{
  "add_blank": true,
  "clean_up_tokenization_spaces": true,
  "is_uroman": false,
  "language": "eng",
  "model_max_length": 1000000000000000019884624838656,
  "normalize": true,
  "pad_token": "k",
  "phonemize": false,
  "tokenizer_class": "VitsTokenizer",
  "unk_token": "<unk>"
}
